lkolbly/cmsis-svd/data/Atmel/ATSAML21G16A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OSC32KCTRL</name>
      <version>1.1.0</version>
      <description>32k Oscillators Control</description>
      <groupName>OSC32KCTRL</groupName>
      <prependToName>OSC32KCTRL_</prependToName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSTEM</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XOSC32KRDY</name>
              <description>XOSC32K Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSC32KRDY</name>
              <description>OSC32K Ready Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XOSC32KRDY</name>
              <description>XOSC32K Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSC32KRDY</name>
              <description>OSC32K Ready Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XOSC32KRDY</name>
              <description>XOSC32K Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSC32KRDY</name>
              <description>OSC32K Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC32K</name>
          <description>32kHz Internal Oscillator (OSC32K) Control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x003F0080</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Oscillator Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN32K</name>
              <description>32kHz Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN1K</name>
              <description>1kHz Output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>On Demand Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Oscillator Start-Up Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WRTLOCK</name>
              <description>Write Lock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALIB</name>
              <description>Oscillator Calibration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCULP32K</name>
          <description>32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN32K</name>
              <description>Enable Out 32k</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN1K</name>
              <description>Enable Out 1k</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALIB</name>
              <description>Oscillator Calibration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>WRTLOCK</name>
              <description>Write Lock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCTRL</name>
          <description>Clock selection</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RTCSEL</name>
              <description>RTC Clock Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>RTCSELSelect</name>
                <enumeratedValue>
                  <name>ULP1K</name>
                  <description>1.024kHz from 32kHz internal ULP oscillator</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULP32K</name>
                  <description>32.768kHz from 32kHz internal ULP oscillator</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC1K</name>
                  <description>1.024kHz from 32.768kHz internal oscillator</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC32K</name>
                  <description>32.768kHz from 32.768kHz internal oscillator</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC1K</name>
                  <description>1.024kHz from 32.768kHz internal oscillator</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC32K</name>
                  <description>32.768kHz from 32.768kHz external crystal oscillator</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Power and Clocks Status</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>XOSC32KRDY</name>
              <description>XOSC32K Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC32KRDY</name>
              <description>OSC32K Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32K</name>
          <description>32kHz External Crystal Oscillator (XOSC32K) Control</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Oscillator Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XTALEN</name>
              <description>Crystal Oscillator Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN32K</name>
              <description>32kHz Output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN1K</name>
              <description>1kHz Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>On Demand Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Oscillator Start-Up Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WRTLOCK</name>
              <description>Write Lock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
