lkolbly/cmsis-svd/data/Atmel/ATSAML21G16A.svd
        <register>
          <name>HALT</name>
          <description>Debug Halt Request</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CM0P</name>
              <description>CM0P Break Master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPP</name>
              <description>PPP Break Master</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVBRK</name>
              <description>Event Break Master</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTBRK</name>
              <description>External Break Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCPUSEL0</name>
          <description>Interrupts CPU Select 0</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSTEM</name>
              <description>SYSTEM Interrupt CPU Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT Interrupt CPU Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTC</name>
              <description>RTC Interrupt CPU Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVMCTRL</name>
              <description>NVMCTRL Interrupt CPU Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB</name>
              <description>USB Interrupt CPU Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM0</name>
              <description>SERCOM0 Interrupt CPU Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM1</name>
              <description>SERCOM1 Interrupt CPU Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM2</name>
              <description>SERCOM2 Interrupt CPU Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM3</name>
              <description>SERCOM3 Interrupt CPU Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM4</name>
              <description>SERCOM4 Interrupt CPU Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM5</name>
              <description>SERCOM5 Interrupt CPU Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC0</name>
              <description>TCC0 Interrupt CPU Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC1</name>
              <description>TCC1 Interrupt CPU Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCPUSEL1</name>
          <description>Interrupts CPU Select 1</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TCC2</name>
              <description>TCC2 Interrupt CPU Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC0</name>
              <description>TC0 Interrupt CPU Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC1</name>
              <description>TC1 Interrupt CPU Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC2</name>
              <description>TC2 Interrupt CPU Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC3</name>
              <description>TC3 Interrupt CPU Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC4</name>
              <description>TC4 Interrupt CPU Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC</name>
              <description>ADC Interrupt CPU Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AC</name>
              <description>AC Interrupt CPU Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC</name>
              <description>DAC Interrupt CPU Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTC</name>
              <description>PTC Interrupt CPU Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AES</name>
              <description>AES Interrupt CPU Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRNG</name>
              <description>TRNG Interrupt CPU Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PICOP</name>
              <description>PICOP Interrupt CPU Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BRK</name>
              <description>Break Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BRK</name>
              <description>Break Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BRK</name>
              <description>Break</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>29</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>INTSTATUS%s</name>
          <description>Interrupt n Status</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IRQ0</name>
              <description>Interrupt Status for Interrupt Request 0 within Interrupt n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ1</name>
              <description>Interrupt Status for Interrupt Request 1 within Interrupt n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ2</name>
              <description>Interrupt Status for Interrupt Request 2 within Interrupt n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ3</name>
              <description>Interrupt Status for Interrupt Request 3 within Interrupt n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ4</name>
              <description>Interrupt Status for Interrupt Request 4 within Interrupt n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ5</name>
              <description>Interrupt Status for Interrupt Request 5 within Interrupt n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ6</name>
              <description>Interrupt Status for Interrupt Request 6 within Interrupt n</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ7</name>
              <description>Interrupt Status for Interrupt Request 7 within Interrupt n</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQTRIG</name>
          <description>Interrupt Trigger</description>
          <addressOffset>0x60</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Trigger Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQNUM</name>
              <description>Interrupt Request Number</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OVERRIDE</name>
              <description>Interrupt Request Override Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESTART</name>
          <description>Debug Restart Request</description>
          <addressOffset>0x0D</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CM0P</name>
              <description>CM0P Break Master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPP</name>
              <description>PPP Break Master</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTBRK</name>
              <description>External Break Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTCTRL</name>
          <description>Reset Control</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
        </register>
